app/Controllers/AdminController.php

SELECT *
FROM `schools`
SELECT *
FROM `kategori_aset`
WHERE `status` = 'aktif'
SELECT *
FROM `ruangan`
WHERE `status` = 'aktif'
---
    public function dashboard()
    {
        // Ambil school_id dari session jika bukan superadmin (null atau 0)
        $userSchoolId = session()->get('school_id'); // school_id dari sesi, jika bukan superadmin

        // Ambil filter dari query string (GET request)
        $school_id = $this->request->getGet('school_id') ?? $userSchoolId; // Gunakan school_id dari session jika bukan superadmin
        $start_date = $this->request->getGet('start_date') ?? '2024-01-01';  // Default tanggal awal jika tidak ada filter
        $end_date = $this->request->getGet('end_date') ?? date('Y-m-d');     // Default tanggal sekarang jika tidak ada filter

        // Jika school_id adalah null atau 0, berarti superadmin, ambil semua sekolah
        if (is_null($school_id) || $school_id == 0) {
            // Untuk superadmin, ambil data dari semua sekolah
            $totalHargaAset = $this->dataAsetModel->getTotalHargaAset(null, $start_date, $end_date);
            $totalAsetPerKategori = $this->dataAsetModel->getTotalAsetPerKategori(null, $start_date, $end_date);
            $totalAsetPerRuangan = $this->dataAsetModel->getTotalAsetPerRuangan(null, $start_date, $end_date);
        } else {
            // Untuk operator sekolah, hanya ambil data berdasarkan school_id mereka
            $totalHargaAset = $this->dataAsetModel->getTotalHargaAset($school_id, $start_date, $end_date);
            $totalAsetPerKategori = $this->dataAsetModel->getTotalAsetPerKategori($school_id, $start_date, $end_date);
            $totalAsetPerRuangan = $this->dataAsetModel->getTotalAsetPerRuangan($school_id, $start_date, $end_date);
        }

        // Ambil daftar semua sekolah untuk dropdown jika superadmin
        $allSchools = [];
        if (is_null($userSchoolId)) {
            $allSchools = $this->schoolModel->findAll(); // Superadmin dapat memilih sekolah
        }

        // Ambil kategori aset dan ruangan
        $kategoriAset = $this->kategoriAsetModel->where('status', 'aktif')->findAll();
        $ruangan = $this->ruanganModel->where('status', 'aktif')->findAll();