app/Controllers/ApprovalController.php

    public function index()
    {
        if (session()->get('role') !== 'superadmin') {
            return redirect()->to('/login');
        }

        // Ambil filter school_id
        $school_id = $this->request->getGet('school_id') ?? 0;

        // Query dengan filter school_id jika diberikan
        $query = $this->db->table('approvals')
            ->select('approvals.*, data_aset.nama_aset, data_aset.kode_inventaris, schools.name as school_name')
            ->join('data_aset', 'data_aset.id = approvals.aset_id')
            ->join('schools', 'schools.id = approvals.school_id');

        if ($school_id != 0) {
            $query->where('approvals.school_id', $school_id);
        }

        $data['approvals'] = $query->get()->getResultArray();
        $data['allSchools'] = $this->schoolModel->findAll();
---
SELECT `approvals`.*, `data_aset`.`nama_aset`, `data_aset`.`kode_inventaris`, `schools`.`name` as `school_name`
FROM `approvals`
JOIN `data_aset` ON `data_aset`.`id` = `approvals`.`aset_id`
JOIN `schools` ON `schools`.`id` = `approvals`.`school_id`
SELECT *
FROM `schools`