app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `npsn` = '00000000'
 LIMIT 1
---
    public function attemptLogin()
    {
        $npsn = $this->request->getPost('npsn');
        $password = $this->request->getPost('password');

        // Cari user berdasarkan NPSN
        $user = $this->userModel->where('npsn', $npsn)->first();