app/Controllers/BaseController.php

SELECT *
FROM `schools`
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Load model sekolah
        $this->schoolModel = new SchoolModel();

        // Jika role superadmin, tambahkan daftar sekolah ke variabel viewData
        if (session()->get('role') === 'superadmin') {
            $this->viewData['schools'] = $this->schoolModel->findAll();