app/Controllers/DependencyController.php

SELECT *
FROM `ruangan`
---
    public function indexRuangan()
    {
        $ruanganModel = new RuanganModel();
        $data['ruangan'] = $ruanganModel->findAll();