app/Controllers/HomeController.php

SELECT *
FROM `schools`
---
    public function index()
    {
        // Load the school model
        $schoolModel = new SchoolModel();

        // Fetch all schools from the database
        $schools = $schoolModel->findAll();