app/Controllers/UserController.php

    public function selectSchool()
    {
        $schoolModel = new \App\Models\SchoolModel();
        $data['schools'] = $schoolModel->findAll(); // Mengambil semua sekolah
---
SELECT *
FROM `schools`