app/Models/DataAsetModel.php

SELECT SUM(`harga_aset`) AS `harga_aset`
FROM `data_aset`
WHERE `tanggal_aset` >= '2024-01-01'
AND `tanggal_aset` <= '2025-04-17'
AND `school_id` = '48'
---
    public function getTotalHargaAset($school_id = null, $start_date = '2000-01-01', $end_date = null)
    {
        $end_date = $end_date ?? date('Y-m-d');

        $query = $this->selectSum('harga_aset')
            ->where("tanggal_aset >=", $start_date)
            ->where("tanggal_aset <=", $end_date);

        if ($school_id) {
            $query->where('school_id', $school_id);
        }

        return $query->get()->getRowArray()['harga_aset'] ?? 0;

SELECT `k`.`id`, `k`.`nama_kategori`, COUNT(a.id) as total
FROM `data_aset` `a`
JOIN `kategori_aset` `k` ON `k`.`id` = `a`.`kategori_aset_id`
WHERE `a`.`tanggal_aset` >= '2024-01-01'
AND `a`.`tanggal_aset` <= '2025-04-17'
AND `k`.`status` = 'aktif'
AND `a`.`school_id` = '48'
GROUP BY `k`.`id`, `k`.`nama_kategori`
---
    public function getTotalAsetPerKategori($school_id = null, $start_date = '2000-01-01', $end_date = null)
    {
        $end_date = $end_date ?? date('Y-m-d');

        $builder = $this->db->table('data_aset a');
        $builder->select('k.id, k.nama_kategori, COUNT(a.id) as total')
               ->join('kategori_aset k', 'k.id = a.kategori_aset_id')
               ->where("a.tanggal_aset >=", $start_date)
               ->where("a.tanggal_aset <=", $end_date)
               ->where('k.status', 'aktif') // Hanya kategori aktif
               ->groupBy('k.id, k.nama_kategori');

        if ($school_id) {
            $builder->where('a.school_id', $school_id);
        }

        return $builder->get()->getResultArray();

SELECT `r`.`id`, `r`.`nama_ruangan`, COUNT(a.id) as total
FROM `data_aset` `a`
JOIN `ruangan` `r` ON `r`.`id` = `a`.`ruangan_id`
WHERE `a`.`tanggal_aset` >= '2024-01-01'
AND `a`.`tanggal_aset` <= '2025-04-17'
AND `r`.`status` = 'aktif'
AND `a`.`school_id` = '48'
GROUP BY `r`.`id`, `r`.`nama_ruangan`
---
    public function getTotalAsetPerRuangan($school_id = null, $start_date = '2000-01-01', $end_date = null)
    {
        $end_date = $end_date ?? date('Y-m-d');

        $builder = $this->db->table('data_aset a');
        $builder->select('r.id, r.nama_ruangan, COUNT(a.id) as total')
               ->join('ruangan r', 'r.id = a.ruangan_id')
               ->where("a.tanggal_aset >=", $start_date)
               ->where("a.tanggal_aset <=", $end_date)
               ->where('r.status', 'aktif') // Hanya ruangan aktif
               ->groupBy('r.id, r.nama_ruangan');

        if ($school_id) {
            $builder->where('a.school_id', $school_id);
        }

        return $builder->get()->getResultArray();